In [2]:
%matplotlib notebook
import matplotlib.pyplot as plt
import numpy as np
import random
import pandas as pd

In [47]:
employee_info=[['John', 32, 421211, 'Sales', 'Florida'],
              ['Jim', 22, 187112, 'Facilties', 'California'],
              ['Joe', 41, 512111, 'Technology', 'Florida'],
              ['Jack', 42, 499123, 'Technology', 'Florida'],
              ['Kim', 51, 613221,'Management', 'California'],
              ['Lynn', 23, 164444,'Sales', 'California'],
              ['Bob', 31, 253122,'Accounts', 'Florida'],
              ['Adam', 27, 211412,'Technology', 'Florida'],
              ['Paul', 37, 378123,'HR', 'California'],
              ['Samantha', 21, 142122,  'HR', 'Florida']]

In [48]:
dataframe_employee_info=pd.DataFrame(student_info, columns=['Name', 'Age', 'Annual Salary', 'Department', 'State'])

In [49]:
dataframe_employee_info

       Name  Age  Annual Salary  Department       State
0      John   32         421211       Sales     Florida
1       Jim   22         187112   Facilties  California
2       Joe   41         512111  Technology     Florida
3      Jack   42         499123  Technology     Florida
4       Kim   51         613221  Management  California
5      Lynn   23         164444       Sales  California
6       Bob   31         253122    Accounts     Florida
7      Adam   27         211412  Technology     Florida
8      Paul   37         378123          HR  California
9  Samantha   21         142122          HR     Florida

In [50]:
department_group=dataframe_employee_info['Annual Salary'].groupby(dataframe_employee_info['Department'])

In [51]:
department_group.sum()

Department
Accounts       253122
Facilties      187112
HR             520245
Management     613221
Sales          585655
Technology    1222646
Name: Annual Salary, dtype: int64

In [52]:
department_group.mean()

Department
Accounts      253122.000000
Facilties     187112.000000
HR            260122.500000
Management    613221.000000
Sales         292827.500000
Technology    407548.666667
Name: Annual Salary, dtype: float64

## You don't have to choose the data column before hand, just the grouping column also works

In [67]:
department_group_alternative=dataframe_employee_info.groupby(dataframe_employee_info['Department'])

In [69]:
## Youngest by department
department_group_alternative['Age'].min()

Department
Accounts      31
Facilties     22
HR            21
Management    51
Sales         23
Technology    27
Name: Age, dtype: int64

In [70]:
## Highesh paid in a department
department_group_alternative['Annual Salary'].max()

Department
Accounts      253122
Facilties     187112
HR            378123
Management    613221
Sales         421211
Technology    512111
Name: Annual Salary, dtype: int64

In [53]:
department_sal_group_dual=dataframe_employee_info['Annual Salary'].groupby([dataframe_employee_info['Department'], dataframe_employee_info['State']])

In [54]:
department_sal_group_dual.mean()

Department  State
Accounts    Florida       253122.000000
Facilties   California    187112.000000
HR          California    378123.000000
            Florida       142122.000000
Management  California    613221.000000
Sales       California    164444.000000
            Florida       421211.000000
Technology  Florida       407548.666667
Name: Annual Salary, dtype: float64

In [55]:
department_sal_group_dual.mean().unstack()

State       California        Florida
Department
Accounts           NaN  253122.000000
Facilties     187112.0            NaN
HR            378123.0  142122.000000
Management    613221.0            NaN
Sales         164444.0  421211.000000
Technology         NaN  407548.666667

In [56]:
for name, group in dataframe_employee_info.groupby('Department'):
    print(name, ':\n' , group, '\n')

Accounts :
   Name  Age  Annual Salary Department    State
6  Bob   31         253122   Accounts  Florida

Facilties :
   Name  Age  Annual Salary Department       State
1  Jim   22         187112  Facilties  California

HR :
        Name  Age  Annual Salary Department       State
8      Paul   37         378123         HR  California
9  Samantha   21         142122         HR     Florida

Management :
   Name  Age  Annual Salary  Department       State
4  Kim   51         613221  Management  California

Sales :
    Name  Age  Annual Salary Department       State
0  John   32         421211      Sales     Florida
5  Lynn   23         164444      Sales  California

Technology :
    Name  Age  Annual Salary  Department    State
2   Joe   41         512111  Technology  Florida
3  Jack   42         499123  Technology  Florida
7  Adam   27         211412  Technology  Florida

### Let us make the grouping code shorter

In [57]:
department_group_long=dataframe_employee_info['Annual Salary'].groupby(dataframe_employee_info['Department'])

In [58]:
department_group_short=dataframe_employee_info.groupby('Department')['Annual Salary']##Note the reverse order

In [59]:
department_group_long.mean()

Department
Accounts      253122.000000
Facilties     187112.000000
HR            260122.500000
Management    613221.000000
Sales         292827.500000
Technology    407548.666667
Name: Annual Salary, dtype: float64

In [60]:
department_group_short.mean()

Department
Accounts      253122.000000
Facilties     187112.000000
HR            260122.500000
Management    613221.000000
Sales         292827.500000
Technology    407548.666667
Name: Annual Salary, dtype: float64

# count	Number of non-NA values in the group
# sum	Sum of non-NA values
# mean	Mean of non-NA values
# median	Arithmetic median of non-NA values
# std, var	Unbiased (n â€“ 1 denominator) standard deviation and variance
# min, max	Minimum and maximum of non-NA values
# prod	Product of non-NA values
# first, last	First and last non-NA values

## Let us define our own function

In [61]:
# We want to know salary by department after a 10% hike

In [62]:
def increaser_sal_group(employee_sal_info):
    return employee_sal_info*1.1

In [63]:
grouped = dataframe_employee_info.groupby('Department')
grouped['Annual Salary'].agg(increaser_sal_group)

Department
Accounts                                        278434
Facilties                                       205823
HR                      [415935.30000000005, 156334.2]
Management                                      674543
Sales         [463332.10000000003, 180888.40000000002]
Technology     [563322.1000000001, 549035.3, 232553.2]
Name: Annual Salary, dtype: object

## Congratulations on your hike, ladies and gentlemen

## Using the apply method

In [ ]:
#Let us define a function which chooses the top n rows in a group
def topn(dataframe, n, column)
    dataframe.sort_valuespython logo